<?php
namespace Luoyecb\Generator;

use Luoyecb\IGenerator;
use Luoyecb\Util\RandUtil;

class NameGenerator implements IGenerator {
    // 百家姓
    protected $surname = array(
        '赵','钱','孙','李','周','吴','郑','王','冯','陈','楮','卫','蒋','沈','韩','杨','朱','秦',
        '尤','许','何','吕','施','张','孔','曹','严','华','金','魏','陶','姜','戚','谢','邹','喻',
        '柏','水','窦','章','云','苏','潘','葛','奚','范','彭','郎','鲁','韦','昌','马','苗','凤',
        '花','方','俞','任','袁','柳','酆','鲍','史','唐','费','廉','岑','薛','雷','贺','倪','汤',
        '滕','殷','罗','毕','郝','邬','安','常','乐','于','时','傅','皮','卞','齐','康','伍','余',
        '元','卜','顾','孟','平','黄','和','穆','萧','尹','姚','邵','湛','汪','祁','毛','禹','狄',
        '米','贝','明','臧','计','伏','成','戴','谈','宋','茅','庞','熊','纪','舒','屈','项','祝',
        '董','梁','杜','阮','蓝','闽','席','季','麻','强','贾','路','娄','危','江','童','颜','郭',
        '梅','盛','林','刁','锺','徐','丘','骆','高','夏','蔡','田','樊','胡','凌','霍','虞','万',
        '支','柯','昝','管','卢','莫','经','房','裘','缪','干','解','应','宗','丁','宣','贲','邓',
        '郁','单','杭','洪','包','诸','左','石','崔','吉','钮','龚','程','嵇','邢','滑','裴','陆',
        '荣','翁','荀','羊','於','惠','甄','麹','家','封','芮','羿','储','靳','汲','邴','糜','松',
        '井','段','富','巫','乌','焦','巴','弓','牧','隗','山','谷','车','侯','宓','蓬','全','郗',
        '班','仰','秋','仲','伊','宫','宁','仇','栾','暴','甘','斜','厉','戎','祖','武','符','刘',
        '景','詹','束','龙','叶','幸','司','韶','郜','黎','蓟','薄','印','宿','白','怀','蒲','邰',
        '从','鄂','索','咸','籍','赖','卓','蔺','屠','蒙','池','乔','阴','郁','胥','能','苍','双',
        '闻','莘','党','翟','谭','贡','劳','逄','姬','申','扶','堵','冉','宰','郦','雍','郤','璩',
        '桑','桂','濮','牛','寿','通','边','扈','燕','冀','郏','浦','尚','农','温','别','庄','晏',
        '柴','瞿','阎','充','慕','连','茹','习','宦','艾','鱼','容','向','古','易','慎','戈','廖',
        '庾','终','暨','居','衡','步','都','耿','满','弘','匡','国','文','寇','广','禄','阙','东',
        '欧','殳','沃','利','蔚','越','夔','隆','师','巩','厍','聂','晁','勾','敖','融','冷','訾',
        '辛','阚','那','简','饶','空','曾','毋','沙','乜','养','鞠','须','丰','巢','关','蒯','相',
        '查','后','荆','红','游','竺','权','逑','盖','益','桓','公','万俟','司马','上官','欧阳','夏侯',
        '诸葛','闻人','东方','赫连','皇甫','尉迟','公羊','澹台','公冶','宗政','濮阳','淳于','单于','太叔',
        '申屠','公孙','仲孙','轩辕','令狐','锺离','宇文','长孙','慕容','鲜于','闾丘','司徒','司空','丌官',
        '司寇','仉','督','子车','颛孙','端木','巫马','公西','漆雕','乐正','壤驷','公良','拓拔','夹谷',
        '谷梁','晋','楚','阎','法','汝','鄢','涂','钦','段干','百里','东郭','南门','呼延','归','海',
        '羊舌','微生','岳','帅','缑','亢','况','后','有','琴','梁丘','左丘','东门','西门','商','牟',
        '佴','伯','赏','南宫','墨','哈','谯','笪','年','爱','阳','佟','第五','言','福','宰父','佘',
    );
    // 男士常见名
    protected $manLastname = array(
        '伟','强','磊','洋','勇','军','杰','涛','超','明',
        '刚','平','辉','鹏','华','飞','鑫','波','斌','宇',
        '浩','凯','健','俊','帆','帅','旭','宁','龙','林',
        '欢','阳','建华','亮','成','畅','建','峰','建国','建军',
        '晨','瑞','志强','兵','雷','东','欣','博','彬','坤',
        '全安','荣','岩','杨','文','利','楠','建平','嘉俊','晧',
        '建明','子安','新华','鹏程','学明','博涛','捷','文彬','楼','鹰',
        '松','伦','超','钟','瑜','振国','洪','毅','昱然','哲',
        '翔','翼','祥','国庆','哲彦','正诚','正豪','正平','正业','志诚',
        '志新','志勇','志明','志强','志文','致远','智明','智勇','智敏','智渊',
    );
    // 女士常见名
    protected $womanLastname = array(
        '芳','娜','敏','静','敏静','秀英','丽','洋','艳','娟',
        '文娟','君','文君','珺','霞','明霞','秀兰','燕','芬','桂芬',
        '玲','桂英','丹','萍','华','红','玉兰','桂兰','英','梅',
        '莉','秀珍','雪','依琳','旭','宁','婷','馨予','玉珍','凤英',
        '晶','欢','玉英','颖','红梅','佳','倩','琴','兰英','云',
        '洁','爱华','淑珍','春梅','海燕','晨','冬梅','秀荣','瑞','桂珍',
        '莹','秀云','桂荣','秀梅','丽娟','婷婷','玉华','琳','雪梅','淑兰',
        '丽丽','玉','秀芳','欣','淑英','桂芳','丽华','丹丹','桂香','淑华',
        '秀华','桂芝','小红','金凤','文','利','楠','红霞','瑜','桂花',
        '璐','凤兰','腊梅','瑶','嘉','怡','冰冰','玉梅','慧','婕','莉莉',
    );

    public function createData() {
        $index = RandUtil::randGe0LeMax(count($this->surname)-1);
        $name = $this->surname[$index];

        $manLen = count($this->manLastname);
        $womanLen = count($this->womanLastname);

        $index = RandUtil::randGe0LeMax($manLen + $womanLen - 1);
        if ($index < $manLen) {
            $name .= $this->manLastname[$index];
        } else {
            $index -= $manLen;
            $name .= $this->womanLastname[$index];
        }

        return $name;
    }
}
